In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

FileNotFoundError: [Errno 2] No such file or directory: 'style-table.css'

In [4]:
titles = pd.read_csv('/Users/omkar/Development/python/AI-ML/day 15-16/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [6]:
titles.isna().sum()

title    0
year     0
dtype: int64

In [14]:
titles['title'].size

244914

### What are the earliest two films listed in the titles dataframe?

In [31]:
titles['year'].min

<bound method Series.min of 0         1996
1         1994
2         1970
3         2007
4         2008
          ...
244909    2018
244910    1980
244911    1970
244912    1995
244913    1987
Name: year, Length: 244914, dtype: int64>

### How many movies have the title "Hamlet"?

In [23]:
titles[titles['title'] == 'Hamlet'].size

40

### How many movies are titled "North by Northwest"?

In [24]:
titles[titles['title'] == 'North by Northwest'].size

2

### When was the first movie titled "Hamlet" made?

In [26]:
titles[titles['title'] == 'Hamlet']['year'].min()

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [32]:
titles[titles['title'] == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [33]:
titles[titles['year'] == 1950]

                          title  year
189          La soif des hommes  1950
268            Sohrab at Rustum  1950
308                       Gemma  1950
314                Rasuna valea  1950
524          Trial Without Jury  1950
...                         ...   ...
244200               Inmaculada  1950
244362        Golden Salamander  1950
244440  Prisoners in Petticoats  1950
244470  The Golden Gloves Story  1950
244820                 Doctor X  1950

[1113 rows x 2 columns]

### How many movies were made in the year 1960?

In [ ]:
titles[titles['year'] == 1960]

### How many movies were made from 1950 through 1959?

In [46]:
data1 = titles[titles['year'] > 1950]
data1['title'].size

208820

In [47]:
data2 = data1[data1['year'] < 1959]
data2['title'].size

10306

### In what years has a movie titled "Batman" been released?

In [48]:
titles[titles['title'] == 'Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [50]:
cast = pd.read_csv('/Users/omkar/Development/python/AI-ML/day 15-16/cast.csv')
cast.head(2)

             title  year      name   type character     n
0   Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

In [59]:
cast[cast['title'] == 'Inception']['title'].size

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [55]:
cast[cast['title'] == 'Inception'].isna().sum()

title         0
year          0
name          0
type          0
character     0
n            27
dtype: int64

In [60]:
cast[cast['title'] == 'Inception']['title'].size

78

In [ ]:
78 total movies 27 did not get n values

### But how many roles in the movie "Inception" did receive an "n" value?

In [ ]:
remaining 51 movies got n value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [63]:
cast[cast['title'] == 'North by Northwest'].sort_values("n").dropna()

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [69]:
data_cast = cast[cast['title'] == 'Sleuth']

In [71]:
data_cast[data_cast['year'] == 1972].sort_values("n")

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [73]:
data_cast[data_cast['year'] == 2007].sort_values("n")

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [77]:
cast_hamlet = cast[cast['title'] == 'Hamlet']

In [79]:
cast_hamlet[cast_hamlet['year'] == 1921]['name'].size

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [81]:
cast_hamlet[cast_hamlet['year'] == 1996]['name'].size

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [83]:
cast_hamlet['name'].size

342

### How many people have played an "Ophelia"?

In [86]:
cast[cast['character'] == 'Ophelia']['name'].size

117

### How many people have played a role called "The Dude"?

In [87]:
cast[cast['character'] == 'The Dude']['name'].size

19

### How many people have played a role called "The Stranger"?

In [88]:
cast[cast['character'] == 'The Stranger']['name'].size

212

### How many roles has Sidney Poitier played throughout his career?

In [89]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [90]:
cast[cast['name'] == 'Sidney Poitier']['name'].size

43

### How many roles has Judi Dench played?

In [91]:
cast[cast['name'] == 'Judi Dench']['name'].size

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [94]:
cast_grant = cast[cast['name'] == 'Cary Grant']

In [96]:
cast_grant_n2 = cast_grant[cast_grant['n'] == 2]

In [97]:
cast_grant_n2[cast_grant_n2['year'] == 1940]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [98]:
cast_grant[cast_grant['year'] == 1940]

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [103]:
cast[cast['year'] == 1950]['name'].size

22397

### How many roles were available for actresses in the 1950s?

In [126]:
cast_actress = cast[cast['type'] == 'actress']

In [128]:
cast_actress[cast_actress['year'] == 1950]['name'].size

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [106]:
cast_1980 = cast[cast['year'] < 1981]

In [115]:
cast_1980[cast_1980['n'] == 1]['name'].size

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [116]:
cast_1980[cast_1980['n'] != 1]['name'].size

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [121]:
cast_1980['n'].isna().sum()

448347